DataProcessors/бит_ПечатьКЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ПечатьКЛС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/лб_ПредставлниеЗданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_ПредставлниеЗданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_НаправленияОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХПоПериоду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХПоПериоду</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/бит_ПечатьКЛС/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЛС") Тогда
	
		ЛицевойСчет = Параметры.ЛС;
	
	КонецЕсли;
	
	Период = НачалоМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	Если Не ЗначениеЗаполнено(ЛицевойСчет) Тогда
		Сообщить("Не заполнен лицевой счет!");
	Иначе
		Результат = СформироватьТабДок();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция СформироватьТабДок()
	
	СведенияОКвартире = ПолучитьСведенияОКвартиреЛС();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ПолеСверху = 6;
	ТабДок.ПолеСнизу = 6;
	ТабДок.ПолеСлева = 6;
	ТабДок.ПолеСправа = 6;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтр1 = Макет.ПолучитьОбласть("Строка1");
	ОбластьДетали = Макет.ПолучитьОбласть("Детали"); 
	ОбластьСтр2 = Макет.ПолучитьОбласть("Строка2"); 
	ОбластьРасчет = Макет.ПолучитьОбласть("Расчет"); 
	
	ЗаполнитьШапку(ОбластьШапка);
	ТабДок.Вывести(ОбластьШапка);
	
	ЗаполнитьСтроку1(ТабДок, ОбластьСтр1);
	//ТабДок.Вывести(ОбластьСтр1);
	
	ЗаполнитьДетали(ОбластьДетали, СведенияОКвартире.СтатусКвартиры);
	ТабДок.Вывести(ОбластьДетали);
	
	ЗаполнитьСтроку2(ТабДок, ОбластьСтр2);
	//ТабДок.Вывести(ОбластьСтр2);
	
	ЗаполнитьРасчет(ОбластьРасчет, СведенияОКвартире.ОбщаяПлощадь,СведенияОКвартире.ЖилаяПлощадь, СведенияОКвартире.НеВыводитьСтрокуДомофон);	
	ТабДок.Вывести(ОбластьРасчет);
	
	Возврат ТабДок;
	
КонецФункции
 
&НаСервере
Процедура ЗаполнитьШапку(ОбластьШапка)
	
	ОбластьШапка.Параметры.КЛСДля = КЛСДля;
	ОбластьШапка.Параметры.ДатаВыдачи = Формат(Период, "ДФ=MM.yyyy");
	ОбластьШапка.Параметры.ЛицевойСчет = ЛицевойСчет;
	
	ПредставлениеЗдания = ПолучитьПредставлениеЗдания();
	
	ОбластьШапка.Параметры.Адрес = " " + ПредставлениеЗдания + ", КВ " + ЛицевойСчет.Квартира.НомерКвартиры;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеЗдания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	лб_ПредставлниеЗданий.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.лб_ПредставлниеЗданий КАК лб_ПредставлниеЗданий
		|ГДЕ
		|	лб_ПредставлниеЗданий.Здание = &Здание";
	
	Запрос.УстановитьПараметр("Здание", ЛицевойСчет.Здание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.Представление; 	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтроку1(ТабДок, ОбластьСтр1)
	
	КолВоСобственников = ПолучитьКоличествоСобственников();
	
	Если Не ПечататьВсюИсторию Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
			|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
			|	ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
			|	ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
			|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
			|	ПроживающиеПоЛССрезПоследних.лб_ДатаВыпискиДляФЛС КАК ДатаСнятияСРегистрации,
			|	ПроживающиеПоЛССрезПоследних.ВладелецКвартиры КАК ВладелецКвартиры,
			|	ПроживающиеПоЛССрезПоследних.лб_ДоляПлощадиСтрокой КАК лб_ДоляПлощадиСтрокой,
			|	ПроживающиеПоЛССрезПоследних.лб_СтрокаРодствДляФЛС КАК лб_СтрокаРодствДляФЛС,
			|	ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ФизЛицоДатаРождения
			|ИЗ
			|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
			|			&Момент,
			|			ЛицевойСчет = &ЛицевойСчет
			|				И НЕ СтатусФизЛица = &СтатусФизЛица) КАК ПроживающиеПоЛССрезПоследних
			|
			|УПОРЯДОЧИТЬ ПО
			|	СтатусФизЛица УБЫВ,
			|	ДатаРегистрации";
		
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		Запрос.УстановитьПараметр("Момент", НачалоДня(Период));
		Запрос.УстановитьПараметр("СтатусФизЛица", Справочники.бит_СтатусФизЛица.НайтиПоКоду("000000003"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьСтр1.Параметры.ФИО = ВыборкаДетальныеЗаписи.ФизЛицо;
			
			РО = ВыборкаДетальныеЗаписи.лб_СтрокаРодствДляФЛС;
			Если СтрНайти(НРег(РО), "ответствен") > 0 Тогда
				РО = "собственник (1/" + КолВоСобственников + ")"; 		
			КонецЕсли; 
			
			ОбластьСтр1.Параметры.РО = РО;
			ОбластьСтр1.Параметры.ДРоджения = Формат(ВыборкаДетальныеЗаписи.ФизЛицоДатаРождения, "ДЛФ=D");
			ОбластьСтр1.Параметры.ДПрописка = Формат(ВыборкаДетальныеЗаписи.ДатаРегистрации, "ДЛФ=D");
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаСнятияСРегистрации) И Не ВыборкаДетальныеЗаписи.ДатаСнятияСРегистрации = "01.01.0001" Тогда
				ОбластьСтр1.Параметры.ДВыписка = Формат(ВыборкаДетальныеЗаписи.ДатаСнятияСРегистрации, "ДЛФ=D; ДП=");
			Иначе
				ОбластьСтр1.Параметры.ДВыписка = "";
			КонецЕсли;
			
			Прописка = "постоянная";
			Если ВыборкаДетальныеЗаписи.СтатусФизЛица = Справочники.бит_СтатусФизЛица.Выписан 
				ИЛИ Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СтатусФизЛица) 
				ИЛИ ВыборкаДетальныеЗаписи.СтатусФизЛица = Справочники.бит_СтатусФизЛица.НайтиПоКоду("00-000007") Тогда
				
				Прописка = "выписан";
			ИначеЕсли ВыборкаДетальныеЗаписи.СтатусФизЛица = Справочники.бит_СтатусФизЛица.ВременнаяРегистрация Тогда  
				Прописка = "временная";
			КонецЕсли; 
			ОбластьСтр1.Параметры.Прописка = Прописка;
			
			ТабДок.Вывести(ОбластьСтр1);
		КонецЦикла;
	
	Иначе	
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_ПроживающиеПоЛС.ФизЛицо КАК ФизЛицо,
			|	бит_ПроживающиеПоЛС.лб_СтрокаРодствДляФЛС КАК лб_СтрокаРодствДляФЛС,
			|	бит_ПроживающиеПоЛС.ФизЛицо.ДатаРождения КАК ФизЛицоДатаРождения,
			|	бит_ПроживающиеПоЛС.ДатаРегистрации КАК ДатаРегистрации,
			|	бит_ПроживающиеПоЛС.лб_ДатаВыпискиДляФЛС КАК ДатаСнятияСРегистрации,
			|	бит_ПроживающиеПоЛС.СтатусФизЛица КАК СтатусФизЛица,
			|	бит_ПроживающиеПоЛС.лб_ДоляПлощадиСтрокой КАК лб_ДоляПлощадиСтрокой
			|ИЗ
			|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
			|ГДЕ
			|	бит_ПроживающиеПоЛС.ЛицевойСчет = &ЛицевойСчет
			|	И НЕ бит_ПроживающиеПоЛС.СтатусФизЛица = &СтатусФизЛица
			|
			|УПОРЯДОЧИТЬ ПО
			|	СтатусФизЛица УБЫВ,
			|	ДатаРегистрации";
		
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		Запрос.УстановитьПараметр("СтатусФизЛица", Справочники.бит_СтатусФизЛица.НайтиПоКоду("000000003"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьСтр1.Параметры.ФИО = ВыборкаДетальныеЗаписи.ФизЛицо;
			
			РО = ВыборкаДетальныеЗаписи.лб_СтрокаРодствДляФЛС;
			Если СтрНайти(НРег(РО), "ответствен") > 0 Тогда
				РО = "собственник (1/" + КолВоСобственников + ")"; 		
			КонецЕсли; 
			
			ОбластьСтр1.Параметры.РО = РО;
			ОбластьСтр1.Параметры.ДРоджения = Формат(ВыборкаДетальныеЗаписи.ФизЛицоДатаРождения, "ДЛФ=D");
			ОбластьСтр1.Параметры.ДПрописка = Формат(ВыборкаДетальныеЗаписи.ДатаРегистрации, "ДЛФ=D");
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаСнятияСРегистрации) И Не ВыборкаДетальныеЗаписи.ДатаСнятияСРегистрации = "01.01.0001" Тогда
				ОбластьСтр1.Параметры.ДВыписка = Формат(ВыборкаДетальныеЗаписи.ДатаСнятияСРегистрации, "ДЛФ=D; ДП=");
			Иначе
				ОбластьСтр1.Параметры.ДВыписка = "";
			КонецЕсли; 
			
			Прописка = "постоянная";
			Если ВыборкаДетальныеЗаписи.СтатусФизЛица = Справочники.бит_СтатусФизЛица.Выписан ИЛИ Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СтатусФизЛица) ИЛИ ВыборкаДетальныеЗаписи.СтатусФизЛица = Справочники.бит_СтатусФизЛица.НайтиПоКоду("00-000007") Тогда
				Прописка = "выписан";
			ИначеЕсли ВыборкаДетальныеЗаписи.СтатусФизЛица = Справочники.бит_СтатусФизЛица.ВременнаяРегистрация Тогда  
				Прописка = "временная";
			КонецЕсли; 
			ОбластьСтр1.Параметры.Прописка = Прописка;
			
			ТабДок.Вывести(ОбластьСтр1);
		КонецЦикла;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоСобственников()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК ФизЛицо
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
		|			&Период,
		|			ЛицевойСчет.Здание = &Здание
		|				И ЛицевойСчет.Квартира.НомерКвартиры = &НомерКв
		|				И НЕ СтатусФизЛица = &УдаленСЛС
		|				И СтепеньРодства = &ОтвЛицо) КАК бит_ПроживающиеПоЛССрезПоследних";
	
	Запрос.УстановитьПараметр("Здание", ЛицевойСчет.Здание);
	Запрос.УстановитьПараметр("НомерКв", ЛицевойСчет.Квартира.НомерКвартиры);
	Запрос.УстановитьПараметр("ОтвЛицо", Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("УдаленСЛС", Справочники.бит_СтатусФизЛица.НайтиПоКоду("000000003"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.ФизЛицо;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДетали(ОбластьДетали, ТипКвартиры)
	
	ОбластьДетали.Параметры.Организация = ЛицевойСчет.Организация.НаименованиеСокращенное;
	ОбластьДетали.Параметры.ТипКвартиры = ТипКвартиры;	
	
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьСтроку2(ТабДок, ОбластьСтр2)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы КАК ПравоустанавливающиеДокументы
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ПравоустанавливающиеДокументы.лб_ИспользоватьАрхивДляФЛС Тогда
			ОбластьСтр2.Параметры.ДокументНаКвартиру = ВыборкаДетальныеЗаписи.ПравоустанавливающиеДокументы.лб_Архив;
		Иначе
			ОбластьСтр2.Параметры.ДокументНаКвартиру = ВыборкаДетальныеЗаписи.ПравоустанавливающиеДокументы.Наименование;
		КонецЕсли; 
		
		ТабДок.Вывести(ОбластьСтр2);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасчет(ОбластьРасчет, ПлОбщая, ПлЖилая, НеВыводитьСтрокуДомофон)
	
	СуммаИтого = 0;
	СодИм = 0;
	тарЛифт = ПолучитьТарифЛифт();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Организация КАК Организация,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот КАК СуммаОборот,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаПриход КАК СуммаПриход,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаРасход КАК СуммаРасход,
		|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
		|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
		|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
		|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета
		|ПОМЕСТИТЬ ВТ_ЛС
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(&ДатаНачала, &ДатаОкончания, , ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних
		|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|				&ДатаОкончания,
		|				ЛицевойСчет = &ЛицевойСчет
		|					И Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
		|			И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ = бит_СведенияПоУслугамЛССрезПоследних.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ЛС.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТ_ЛС.УслугаЖКХ КАК УслугаЖКХ,
		|	ВТ_ЛС.Организация КАК Организация,
		|	ВТ_ЛС.СуммаПриход КАК Начислено,
		|	бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка КАК Тариф
		|ИЗ
		|	ВТ_ЛС КАК ВТ_ЛС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних КАК бит_СтавкиНаУслугиСрезПоследних
		|		ПО ВТ_ЛС.УслугаЖКХ = бит_СтавкиНаУслугиСрезПоследних.Услуга
		|			И ВТ_ЛС.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры
		|			И ВТ_ЛС.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры
		|			И ВТ_ЛС.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
		|			И ВТ_ЛС.СпособРасчета = бит_СтавкиНаУслугиСрезПоследних.СпособРасчета";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(КонецДня(Период),-1));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Период));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Квартира", ЛицевойСчет.Квартира);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.УслугаЖКХ = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001") Тогда // содержание и ремонт
			ОбластьРасчет.Параметры.тарСодРем = ВыборкаДетальныеЗаписи.Тариф;
			ОбластьРасчет.Параметры.СодРем = ВыборкаДетальныеЗаписи.Начислено;
			СуммаИтого = СуммаИтого + ВыборкаДетальныеЗаписи.Начислено; 
		ИначеЕсли ВыборкаДетальныеЗаписи.УслугаЖКХ = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000010") Тогда // эл энергия 	
			ОбластьРасчет.Параметры.тарЭлЭнОДН = ВыборкаДетальныеЗаписи.Тариф;
			ОбластьРасчет.Параметры.ЭлЭнОДН = ВыборкаДетальныеЗаписи.Начислено;
			СуммаИтого = СуммаИтого + ВыборкаДетальныеЗаписи.Начислено;
			СодИм = СодИм + ВыборкаДетальныеЗаписи.Начислено; 
		ИначеЕсли ВыборкаДетальныеЗаписи.УслугаЖКХ = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000011") Тогда // гвс 	
			ОбластьРасчет.Параметры.тарГорВодОДН = ВыборкаДетальныеЗаписи.Тариф;
			ОбластьРасчет.Параметры.ГорВодОДН = ВыборкаДетальныеЗаписи.Начислено;
			СуммаИтого = СуммаИтого + ВыборкаДетальныеЗаписи.Начислено;
			СодИм = СодИм + ВыборкаДетальныеЗаписи.Начислено;
		ИначеЕсли ВыборкаДетальныеЗаписи.УслугаЖКХ = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000012") Тогда // хвс 	
			ОбластьРасчет.Параметры.тар_ХолВодОДН = ВыборкаДетальныеЗаписи.Тариф;
			ОбластьРасчет.Параметры.ХолВодОДН = ВыборкаДетальныеЗаписи.Начислено;
			СуммаИтого = СуммаИтого + ВыборкаДетальныеЗаписи.Начислено;
			СодИм = СодИм + ВыборкаДетальныеЗаписи.Начислено;
		ИначеЕсли ВыборкаДетальныеЗаписи.УслугаЖКХ = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000015") Тогда // водоотведение 	
			ОбластьРасчет.Параметры.тар_ВодоотвОДН = ВыборкаДетальныеЗаписи.Тариф;
			ОбластьРасчет.Параметры.ВодоотвОДН = ВыборкаДетальныеЗаписи.Начислено;
			СуммаИтого = СуммаИтого + ВыборкаДетальныеЗаписи.Начислено;
			СодИм = СодИм + ВыборкаДетальныеЗаписи.Начислено;
		ИначеЕсли ВыборкаДетальныеЗаписи.УслугаЖКХ = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000007") Тогда // домофон 	
			Если Не НеВыводитьСтрокуДомофон Тогда
				ОбластьРасчет.Параметры.тарДомофон = ВыборкаДетальныеЗаписи.Тариф;
				ОбластьРасчет.Параметры.Домофон = ВыборкаДетальныеЗаписи.Начислено;
				СуммаИтого = СуммаИтого + ВыборкаДетальныеЗаписи.Начислено;
				СодИм = СодИм + ВыборкаДетальныеЗаписи.Начислено;	
			КонецЕсли; 
		ИначеЕсли СтрНайти(Нрег(ВыборкаДетальныеЗаписи.УслугаЖКХ.Наименование), "антенна") > 0 Тогда // антенна 	
			ОбластьРасчет.Параметры.тарАнтенна = ВыборкаДетальныеЗаписи.Тариф;
			ОбластьРасчет.Параметры.Антенна = ВыборкаДетальныеЗаписи.Начислено;
			СуммаИтого = СуммаИтого + ВыборкаДетальныеЗаписи.Начислено;
			СодИм = СодИм + ВыборкаДетальныеЗаписи.Начислено;
		ИначеЕсли ВыборкаДетальныеЗаписи.УслугаЖКХ = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000008") Тогда // кап рем 	
			ОбластьРасчет.Параметры.тарКР = ВыборкаДетальныеЗаписи.Тариф;
			ОбластьРасчет.Параметры.КР = ВыборкаДетальныеЗаписи.Начислено;
			СуммаИтого = СуммаИтого + ВыборкаДетальныеЗаписи.Начислено;
		ИначеЕсли ВыборкаДетальныеЗаписи.УслугаЖКХ = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000018") Тогда // доп усл	
			ОбластьРасчет.Параметры.тарДопСборы = ВыборкаДетальныеЗаписи.Тариф;
			ОбластьРасчет.Параметры.ДопСборы = ВыборкаДетальныеЗаписи.Начислено;
			СуммаИтого = СуммаИтого + ВыборкаДетальныеЗаписи.Начислено;
			СодИм = СодИм + ВыборкаДетальныеЗаписи.Начислено;
		ИначеЕсли ВыборкаДетальныеЗаписи.УслугаЖКХ = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000017") ИЛИ СтрНайти(Нрег(ВыборкаДетальныеЗаписи.УслугаЖКХ.Наименование), "газ") > 0  Тогда // газ	
			ОбластьРасчет.Параметры.тарГаз = ПолучитьДанныеГазоснабжения().Тариф;
			ОбластьРасчет.Параметры.ЕдИзмГаз = ПолучитьДанныеГазоснабжения().ЕдИзмГаз;
			ОбластьРасчет.Параметры.Газ = ВыборкаДетальныеЗаписи.Начислено;
			СуммаИтого = СуммаИтого + ВыборкаДетальныеЗаписи.Начислено;
		КонецЕсли; 
		
	КонецЦикла;
	
	ОбластьРасчет.Параметры.Итого = СуммаИтого;
	ОбластьРасчет.Параметры.Долг = ПолучитьСуммуДолга();
	ОбластьРасчет.Параметры.СодИм = СодИм;
	ОбластьРасчет.Параметры.тарСодИм = СодИм / ?(Не ЗначениеЗаполнено(ПлОбщая),1,ПлОбщая);
	
	ОбластьРасчет.Параметры.тарЛифт = тарЛифт;
	ОбластьРасчет.Параметры.Лифт = тарЛифт * ПлОбщая;
	
	ОбластьРасчет.Параметры.МесяцГод = Формат(Период, "ДФ=MM.yyyy"); 
	
	ОбластьРасчет.Параметры.ПлОбщая = ПлОбщая;
	ОбластьРасчет.Параметры.КолПроживающих = ПолучитьПостоянноПроживающих();
	ОбластьРасчет.Параметры.КолКомнат = ЛицевойСчет.Квартира.КоличествоКомнат;
	ОбластьРасчет.Параметры.Этаж = ЛицевойСчет.Квартира.Этаж;
	ОбластьРасчет.Параметры.ПлЖилая = ПлЖилая;
	
	ОбластьРасчет.Параметры.ДатаВыдачиРасчета = Формат(ТекущаяДата(), "ДЛФ=D");
	
	ОбластьРасчет.Параметры.ДолжностьПодписанта1 = ДолжностьПодписанта1;
	ОбластьРасчет.Параметры.ДолжностьПодписанта2 = ДолжностьПодписанта2;
	ОбластьРасчет.Параметры.Подписант1 = Подписант1;
	ОбластьРасчет.Параметры.Подписант2 = Подписант2;
	
КонецПроцедуры
 
&НаСервере
Функция ПолучитьСведенияОКвартиреЛС()
	
	Структура = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
		|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.лб_НеВыводитьСтрокуДомофон КАК НеВыводитьСтрокуДомофон
		|ИЗ
		|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
	
	Запрос.УстановитьПараметр("Момент"   ,КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Квартира" ,ЛицевойСчет.Квартира);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат "";
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Структура.Вставить("СтатусКвартиры", Выборка.СтатусКвартиры);
			Структура.Вставить("ОбщаяПлощадь", Выборка.ОбщаяПлощадь);
			Структура.Вставить("ЖилаяПлощадь", Выборка.ЖилаяПлощадь);
			Структура.Вставить("НеВыводитьСтрокуДомофон", Выборка.НеВыводитьСтрокуДомофон);
		КонецЦикла;
		
		Возврат Структура;	
		
	КонецЕсли; 
	
КонецФункции
 
&НаСервере
Функция ПолучитьСуммуДолга()
	
	ДатаДолга = ПолучитьДатуДолга(ЛицевойСчет.Организация, КонецДня(Период));
	
	// Определим сумму долга по начислениям для текущего лицевого счета.
	ЗапросПоНачислениям = Новый Запрос;
	ЗапросПоНачислениям.УстановитьПараметр("КонецПериода", КонецДня(Период));
	ЗапросПоНачислениям.УстановитьПараметр("ЛицевойСчет" , ЛицевойСчет);
	ЗапросПоНачислениям.УстановитьПараметр("ДатаДолга"   , ДатаДолга);
	ЗапросПоНачислениям.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0)
	|	КОНЕЦ КАК Долг
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|		СУММА(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток) КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&ДатаДолга {(&ДатаДолга)}, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет) КАК Долг
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|			СУММА(ВЫБОР
	|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|						ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|				КОНЕЦ) КАК Оплата,
	|			СУММА(ВЫБОР
	|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|						ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|				КОНЕЦ) КАК Разовые
	|		ИЗ
	|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(НАЧАЛОПЕРИОДА(&ДатаДолга, МЕСЯЦ) {(&ДатаДолга)}, &КонецПериода {(&КонецПериода)}, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет) КАК ОплатаСДатыДолга
	|		ПО Долг.ЛицевойСчет = ОплатаСДатыДолга.ЛицевойСчет";
	
	тмпДолг = 0;
	Выборка = ЗапросПоНачислениям.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		тмпДолг = Выборка.Долг;
	КонецЕсли;
	Возврат тмпДолг; 
	
КонецФункции

&НаСервере
Функция ПолучитьДатуДолга(Организация, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -(ВЫБОР
	|				КОГДА ДЕНЬ(&Дата) > бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ + бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени)), МЕСЯЦ) КАК Дата
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата"       , Дата);
	
	Возврат ?(Запрос.Выполнить().Пустой(), ТекущаяДата(),Запрос.Выполнить().Выгрузить()[0].Дата);
	
КонецФункции

&НаСервере
Функция ПолучитьТарифЛифт()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ЕСТЬNULL(БИТ_ТарифыЛифт.Тариф, 0) КАК Тариф
	//|ИЗ
	//|	РегистрСведений.БИТ_ТарифыЛифт КАК БИТ_ТарифыЛифт";
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(БИТ_ТарифыЛифтСрезПоследних.Тариф, 0) КАК Тариф
	|ИЗ
	|	РегистрСведений.БИТ_ТарифыЛифт.СрезПоследних(&Период, ) КАК БИТ_ТарифыЛифтСрезПоследних
	|ГДЕ
	|	БИТ_ТарифыЛифтСрезПоследних.Объект = ЗНАЧЕНИЕ(справочник.бит_списокЗданий.пустаяссылка)";
	запрос.УстановитьПараметр("Период",период);
	
	запрос2 = новый запрос;
	запрос2.текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(БИТ_ТарифыЛифтСрезПоследних.Тариф, 0) КАК Тариф
	|ИЗ
	|	РегистрСведений.БИТ_ТарифыЛифт.СрезПоследних(&период, Объект = &объект) КАК БИТ_ТарифыЛифтСрезПоследних
	|ГДЕ
	|	БИТ_ТарифыЛифтСрезПоследних.Объект <> ЗНАЧЕНИЕ(справочник.бит_списокЗданий.пустаяссылка)";
	запрос2.УстановитьПараметр("Объект",ЛицевойСчет.Здание);
	запрос2.УстановитьПараметр("Период",период);
	выборка2 = запрос2.Выполнить().Выбрать();
	если выборка2.Количество() = 0 тогда
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Тариф),ВыборкаДетальныеЗаписи.Тариф,0);	
	иначе
		выборка2.Следующий();
		Возврат ?(ЗначениеЗаполнено(выборка2.Тариф),выборка2.Тариф,0);	
	КонецЕсли;

		
КонецФункции
 
&НаСервере
Функция ПолучитьДанныеГазоснабжения()
	
	Структура = Новый Структура;
	
	ТарифыГаз = РегистрыСведений.ТарифыГазоснабжения.ПолучитьПоследнее(НачалоДня(Период));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик КАК Счетчик
		|ИЗ
		|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
		|			&Период,
		|			Объект = &ЛицевойСчет
		|				И Счетчик.ВидСчетчика = &ВидСчетчика) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|ГДЕ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать";
	
	Запрос.УстановитьПараметр("ВидСчетчика", Справочники.бит_ВидыСчетчиков.НайтиПоКоду("00-000005"));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Структура.Вставить("ЕдИзмГаз", "м3");
		Структура.Вставить("Тариф", ТарифыГаз.ТарифПоКубМ);
		
	Иначе	
		
		Структура.Вставить("ЕдИзмГаз", "кг");
		Структура.Вставить("Тариф", ТарифыГаз.ТарифПоКг);
		
	КонецЕсли; 
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ПолучитьПостоянноПроживающих()
	
	КоличествоПроживающих = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК ФизЛицо
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
		|			&Период,
		|			ЛицевойСчет.Здание = &Здание
		|				И ЛицевойСчет.Квартира.НомерКвартиры = &НомерКв
		|				И НЕ СтатусФизЛица = &УдаленСЛС
		|				И (СтатусПроживания = &Постоянно
		|					ИЛИ СтатусПроживания = &Временно)) КАК бит_ПроживающиеПоЛССрезПоследних";
	
	Запрос.УстановитьПараметр("Временно", Перечисления.бит_СтатусПроживания.Временно);
	Запрос.УстановитьПараметр("Постоянно", Перечисления.бит_СтатусПроживания.Постоянно);
	Запрос.УстановитьПараметр("Здание", ЛицевойСчет.Здание);
	Запрос.УстановитьПараметр("НомерКв", ЛицевойСчет.Квартира.НомерКвартиры);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("УдаленСЛС", Справочники.бит_СтатусФизЛица.НайтиПоКоду("000000003"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	КоличествоПроживающих = ВыборкаДетальныеЗаписи.ФизЛицо;
	
	Возврат КоличествоПроживающих;
	
КонецФункции
